Repository: xiaocang/easydict_win32
Catalog: dotnet/src/Easydict.WinUI/Strings/*/Resources.resw
Source language: en_us
Languages: ar_sa, da_dk, de_de, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, ms_my, th_th, vi_vn, zh_cn, zh_tw

# DeepLDescription
source: Leave API key empty to use free web translation. Pro API key gives higher limits.
ar_sa: اترك مفتاح API فارغاً لاستخدام ترجمة الويب المجانية. مفتاح Pro API يوفر حدوداً أعلى.
da_dk: Lad API-nøglen være tom for at bruge gratis weboversættelse. Pro API-nøgle giver højere grænser.
de_de: Lassen Sie den API-Schlüssel leer, um die kostenlose Web-Übersetzung zu nutzen. Pro-API-Schlüssel bieten höhere Limits.
fr_fr: Laissez la clé API vide pour utiliser la traduction web gratuite. La clé API Pro offre des limites plus élevées.
hi_in: मुफ़्त वेब अनुवाद के लिए API key खाली छोड़ें। Pro API key से अधिक सीमा मिलती है।
id_id: Biarkan API key kosong untuk menggunakan terjemahan web gratis. API key Pro memberikan batas lebih tinggi.
it_it: Lascia la chiave API vuota per usare la traduzione web gratuita. La chiave API Pro offre limiti più elevati.
ja_jp: APIキーを空にすると無料ウェブ翻訳を使用します。Pro APIキーで制限が増加します。
ko_kr: API 키를 비워두면 무료 웹 번역을 사용합니다. Pro API 키로 제한이 늘어납니다.
ms_my: Biarkan kunci API kosong untuk menggunakan terjemahan web percuma. Kunci API Pro memberikan had yang lebih tinggi.
th_th: เว้น API key ว่างเพื่อใช้การแปลเว็บฟรี API key Pro มีขีดจำกัดที่สูงกว่า
vi_vn: Để trống API key để sử dụng dịch web miễn phí. API key Pro có giới hạn cao hơn.
zh_cn: 留空 API 密钥可使用免费网页翻译。Pro API 密钥有更高的限额。
zh_tw: 留空 API 金鑰可使用免費網頁翻譯。Pro API 金鑰有更高的限額。

# DeepLFreeOption
source: Use Free API (no API key required for web translation)
ar_sa: استخدام API المجاني (ترجمة الويب لا تتطلب مفتاح API)
da_dk: Brug gratis API (weboversættelse kræver ingen API-nøgle)
de_de: Kostenlose API verwenden (kein API-Schlüssel für Web-Übersetzung erforderlich)
fr_fr: Utiliser l'API gratuite (aucune clé API requise pour la traduction web)
hi_in: मुफ़्त API का उपयोग करें (वेब अनुवाद के लिए API key आवश्यक नहीं)
id_id: Gunakan API Gratis (terjemahan web tidak memerlukan API key)
it_it: Usa API gratuita (la traduzione web non richiede chiave API)
ja_jp: 無料APIを使用（ウェブ翻訳にはAPIキー不要）
ko_kr: 무료 API 사용 (웹 번역에 API 키 불필요)
ms_my: Gunakan API Percuma (terjemahan web tidak memerlukan kunci API)
th_th: ใช้ API ฟรี (การแปลเว็บไม่ต้องใช้ API key)
vi_vn: Sử dụng API miễn phí (dịch web không cần API key)
zh_cn: 使用免费 API（网页翻译无需 API 密钥）
zh_tw: 使用免費 API（網頁翻譯無需 API 金鑰）

# OpenAIDescription
source: You can type a custom model name directly.
ar_sa: يمكنك كتابة اسم نموذج مخصص مباشرة.
da_dk: Du kan skrive et brugerdefineret modelnavn direkte.
de_de: Sie können einen benutzerdefinierten Modellnamen direkt eingeben.
fr_fr: Vous pouvez saisir directement un nom de modèle personnalisé.
hi_in: आप सीधे कस्टम model नाम टाइप कर सकते हैं।
id_id: Anda dapat mengetik nama model kustom secara langsung.
it_it: Puoi digitare direttamente un nome di modello personalizzato.
ja_jp: カスタムモデル名を直接入力できます。
ko_kr: 사용자 정의 모델 이름을 직접 입력할 수 있습니다.
ms_my: Anda boleh menaip nama model tersuai secara terus.
th_th: คุณสามารถพิมพ์ชื่อ model ที่กำหนดเองได้โดยตรง
vi_vn: Bạn có thể nhập trực tiếp tên model tùy chỉnh.
zh_cn: 您可以直接输入自定义模型名称。
zh_tw: 您可以直接輸入自訂模型名稱。

# DeepSeekDescription
source: Get your API key from platform.deepseek.com. You can type a custom model name.
ar_sa: احصل على مفتاح API من platform.deepseek.com. يمكنك كتابة اسم نموذج مخصص.
da_dk: Hent din API-nøgle fra platform.deepseek.com. Du kan skrive et brugerdefineret modelnavn.
de_de: Holen Sie sich Ihren API-Schlüssel von platform.deepseek.com. Sie können einen benutzerdefinierten Modellnamen eingeben.
fr_fr: Obtenez votre clé API sur platform.deepseek.com. Vous pouvez saisir un nom de modèle personnalisé.
hi_in: platform.deepseek.com से API key प्राप्त करें। आप कस्टम model नाम टाइप कर सकते हैं।
id_id: Dapatkan API key dari platform.deepseek.com. Anda dapat mengetik nama model kustom.
it_it: Ottieni la tua chiave API da platform.deepseek.com. Puoi digitare un nome di modello personalizzato.
ja_jp: platform.deepseek.comからAPIキーを取得してください。カスタムモデル名を入力できます。
ko_kr: platform.deepseek.com에서 API 키를 받으세요. 사용자 정의 모델 이름을 입력할 수 있습니다.
ms_my: Dapatkan kunci API anda dari platform.deepseek.com. Anda boleh menaip nama model tersuai.
th_th: รับ API key จาก platform.deepseek.com คุณสามารถพิมพ์ชื่อ model ที่กำหนดเอง
vi_vn: Lấy API key tại platform.deepseek.com. Bạn có thể nhập tên model tùy chỉnh.
zh_cn: 从 platform.deepseek.com 获取您的 API 密钥。您可以输入自定义模型名称。
zh_tw: 從 platform.deepseek.com 取得您的 API 金鑰。您可以輸入自訂模型名稱。

# GroqDescription
source: Groq provides fast inference. Get your API key from console.groq.com. You can type a custom model name.
ar_sa: يوفر Groq استدلالاً سريعاً. احصل على مفتاح API من console.groq.com. يمكنك كتابة اسم نموذج مخصص.
da_dk: Groq leverer hurtig inferens. Hent din API-nøgle fra console.groq.com. Du kan skrive et brugerdefineret modelnavn.
de_de: Groq bietet schnelle Inferenz. Holen Sie sich Ihren API-Schlüssel von console.groq.com. Sie können einen benutzerdefinierten Modellnamen eingeben.
fr_fr: Groq offre une inférence rapide. Obtenez votre clé API sur console.groq.com. Vous pouvez saisir un nom de modèle personnalisé.
hi_in: Groq तेज़ इंफ़रेंस प्रदान करता है। console.groq.com से API key प्राप्त करें। आप कस्टम model नाम टाइप कर सकते हैं।
id_id: Groq menyediakan inferensi cepat. Dapatkan API key dari console.groq.com. Anda dapat mengetik nama model kustom.
it_it: Groq fornisce inferenza veloce. Ottieni la tua chiave API da console.groq.com. Puoi digitare un nome di modello personalizzato.
ja_jp: Groqは高速推論を提供します。console.groq.comからAPIキーを取得してください。カスタムモデル名を入力できます。
ko_kr: Groq는 빠른 추론을 제공합니다. console.groq.com에서 API 키를 받으세요. 사용자 정의 모델 이름을 입력할 수 있습니다.
ms_my: Groq menyediakan inferens pantas. Dapatkan kunci API dari console.groq.com. Anda boleh menaip nama model tersuai.
th_th: Groq ให้การอนุมานที่รวดเร็ว รับ API key จาก console.groq.com คุณสามารถพิมพ์ชื่อ model ที่กำหนดเอง
vi_vn: Groq cung cấp suy luận nhanh. Lấy API key tại console.groq.com. Bạn có thể nhập tên model tùy chỉnh.
zh_cn: Groq 提供快速推理。从 console.groq.com 获取您的 API 密钥。您可以输入自定义模型名称。
zh_tw: Groq 提供快速推論。從 console.groq.com 取得您的 API 金鑰。您可以輸入自訂模型名稱。

# ZhipuDescription
source: Get your API key from open.bigmodel.cn. You can type a custom model name.
ar_sa: احصل على مفتاح API من open.bigmodel.cn. يمكنك كتابة اسم نموذج مخصص.
da_dk: Hent din API-nøgle fra open.bigmodel.cn. Du kan skrive et brugerdefineret modelnavn.
de_de: Holen Sie sich Ihren API-Schlüssel von open.bigmodel.cn. Sie können einen benutzerdefinierten Modellnamen eingeben.
fr_fr: Obtenez votre clé API sur open.bigmodel.cn. Vous pouvez saisir un nom de modèle personnalisé.
hi_in: open.bigmodel.cn से API key प्राप्त करें। आप कस्टम model नाम टाइप कर सकते हैं।
id_id: Dapatkan API key dari open.bigmodel.cn. Anda dapat mengetik nama model kustom.
it_it: Ottieni la tua chiave API da open.bigmodel.cn. Puoi digitare un nome di modello personalizzato.
ja_jp: open.bigmodel.cnからAPIキーを取得してください。カスタムモデル名を入力できます。
ko_kr: open.bigmodel.cn에서 API 키를 받으세요. 사용자 정의 모델 이름을 입력할 수 있습니다.
ms_my: Dapatkan kunci API dari open.bigmodel.cn. Anda boleh menaip nama model tersuai.
th_th: รับ API key จาก open.bigmodel.cn คุณสามารถพิมพ์ชื่อ model ที่กำหนดเอง
vi_vn: Lấy API key tại open.bigmodel.cn. Bạn có thể nhập tên model tùy chỉnh.
zh_cn: 从 open.bigmodel.cn 获取您的 API 密钥。您可以输入自定义模型名称。
zh_tw: 從 open.bigmodel.cn 取得您的 API 金鑰。您可以輸入自訂模型名稱。

# GitHubModelsDescription
source: Use your GitHub personal access token. Get one from github.com/settings/tokens. You can type a custom model name.
ar_sa: استخدم رمز الوصول الشخصي لـ GitHub. احصل عليه من github.com/settings/tokens. يمكنك كتابة اسم نموذج مخصص.
da_dk: Brug dit personlige GitHub-adgangstoken. Hent det fra github.com/settings/tokens. Du kan skrive et brugerdefineret modelnavn.
de_de: Verwenden Sie Ihr GitHub-Personal-Access-Token. Erstellen Sie eines unter github.com/settings/tokens. Sie können einen benutzerdefinierten Modellnamen eingeben.
fr_fr: Utilisez votre jeton d'accès personnel GitHub. Obtenez-le sur github.com/settings/tokens. Vous pouvez saisir un nom de modèle personnalisé.
hi_in: अपना GitHub personal access token उपयोग करें। github.com/settings/tokens से प्राप्त करें। आप कस्टम model नाम टाइप कर सकते हैं।
id_id: Gunakan personal access token GitHub Anda. Dapatkan dari github.com/settings/tokens. Anda dapat mengetik nama model kustom.
it_it: Usa il tuo token di accesso personale GitHub. Ottienilo da github.com/settings/tokens. Puoi digitare un nome di modello personalizzato.
ja_jp: GitHubの個人アクセストークンを使用します。github.com/settings/tokensから取得してください。カスタムモデル名を入力できます。
ko_kr: GitHub 개인 액세스 토큰을 사용하세요. github.com/settings/tokens에서 받으세요. 사용자 정의 모델 이름을 입력할 수 있습니다.
ms_my: Gunakan token akses peribadi GitHub anda. Dapatkan dari github.com/settings/tokens. Anda boleh menaip nama model tersuai.
th_th: ใช้ personal access token ของ GitHub รับได้จาก github.com/settings/tokens คุณสามารถพิมพ์ชื่อ model ที่กำหนดเอง
vi_vn: Sử dụng personal access token GitHub. Lấy tại github.com/settings/tokens. Bạn có thể nhập tên model tùy chỉnh.
zh_cn: 使用您的 GitHub 个人访问令牌。从 github.com/settings/tokens 获取。您可以输入自定义模型名称。
zh_tw: 使用您的 GitHub 個人存取權杖。從 github.com/settings/tokens 取得。您可以輸入自訂模型名稱。

# GeminiDescription
source: Get your API key from aistudio.google.com. You can type a custom model name.
ar_sa: احصل على مفتاح API من aistudio.google.com. يمكنك كتابة اسم نموذج مخصص.
da_dk: Hent din API-nøgle fra aistudio.google.com. Du kan skrive et brugerdefineret modelnavn.
de_de: Holen Sie sich Ihren API-Schlüssel von aistudio.google.com. Sie können einen benutzerdefinierten Modellnamen eingeben.
fr_fr: Obtenez votre clé API sur aistudio.google.com. Vous pouvez saisir un nom de modèle personnalisé.
hi_in: aistudio.google.com से API key प्राप्त करें। आप कस्टम model नाम टाइप कर सकते हैं।
id_id: Dapatkan API key dari aistudio.google.com. Anda dapat mengetik nama model kustom.
it_it: Ottieni la tua chiave API da aistudio.google.com. Puoi digitare un nome di modello personalizzato.
ja_jp: aistudio.google.comからAPIキーを取得してください。カスタムモデル名を入力できます。
ko_kr: aistudio.google.com에서 API 키를 받으세요. 사용자 정의 모델 이름을 입력할 수 있습니다.
ms_my: Dapatkan kunci API dari aistudio.google.com. Anda boleh menaip nama model tersuai.
th_th: รับ API key จาก aistudio.google.com คุณสามารถพิมพ์ชื่อ model ที่กำหนดเอง
vi_vn: Lấy API key tại aistudio.google.com. Bạn có thể nhập tên model tùy chỉnh.
zh_cn: 从 aistudio.google.com 获取您的 API 密钥。您可以输入自定义模型名称。
zh_tw: 從 aistudio.google.com 取得您的 API 金鑰。您可以輸入自訂模型名稱。

# CustomOpenAIDescription
source: Configure any OpenAI-compatible API endpoint (e.g., local LLM servers, other AI providers).
ar_sa: تكوين أي نقطة اتصال API متوافقة مع OpenAI (مثل خوادم LLM المحلية، مزودي AI آخرين).
da_dk: Konfigurer ethvert OpenAI-kompatibelt API-endpoint (f.eks. lokale LLM-servere, andre AI-udbydere).
de_de: Konfigurieren Sie jeden OpenAI-kompatiblen API-Endpunkt (z.B. lokale LLM-Server, andere KI-Anbieter).
fr_fr: Configurez n'importe quel point de terminaison API compatible OpenAI (ex : serveurs LLM locaux, autres fournisseurs IA).
hi_in: कोई भी OpenAI-संगत API endpoint कॉन्फ़िगर करें (जैसे स्थानीय LLM सर्वर, अन्य AI प्रदाता)।
id_id: Konfigurasikan endpoint API yang kompatibel dengan OpenAI (mis. server LLM lokal, penyedia AI lainnya).
it_it: Configura qualsiasi endpoint API compatibile con OpenAI (ad es. server LLM locali, altri provider AI).
ja_jp: OpenAI互換のAPIエンドポイントを設定します（例：ローカルLLMサーバー、他のAIプロバイダー）。
ko_kr: OpenAI 호환 API 엔드포인트를 구성합니다 (예: 로컬 LLM 서버, 기타 AI 제공업체).
ms_my: Konfigurasikan sebarang endpoint API yang serasi dengan OpenAI (cth. pelayan LLM tempatan, pembekal AI lain).
th_th: กำหนดค่า endpoint API ที่เข้ากันได้กับ OpenAI (เช่น เซิร์ฟเวอร์ LLM ในเครื่อง ผู้ให้บริการ AI อื่น)
vi_vn: Cấu hình bất kỳ endpoint API tương thích OpenAI (ví dụ: máy chủ LLM cục bộ, nhà cung cấp AI khác).
zh_cn: 配置任何与 OpenAI 兼容的 API 端点（例如本地 LLM 服务器、其他 AI 提供商）。
zh_tw: 設定任何與 OpenAI 相容的 API 端點（例如本機 LLM 伺服器、其他 AI 提供商）。

# OllamaDescription
source: Ollama must be running locally. Click Refresh to load available models.
ar_sa: يجب أن يكون Ollama قيد التشغيل محلياً. انقر على تحديث لتحميل النماذج المتاحة.
da_dk: Ollama skal køre lokalt. Klik Opdater for at indlæse tilgængelige modeller.
de_de: Ollama muss lokal ausgeführt werden. Klicken Sie auf Aktualisieren, um verfügbare Modelle zu laden.
fr_fr: Ollama doit être en cours d'exécution localement. Cliquez sur Actualiser pour charger les modèles disponibles.
hi_in: Ollama स्थानीय रूप से चल रहा होना चाहिए। उपलब्ध model लोड करने के लिए रीफ़्रेश पर क्लिक करें।
id_id: Ollama harus berjalan secara lokal. Klik Segarkan untuk memuat model yang tersedia.
it_it: Ollama deve essere in esecuzione localmente. Clicca Aggiorna per caricare i modelli disponibili.
ja_jp: Ollamaはローカルで実行している必要があります。更新をクリックして利用可能なモデルを読み込みます。
ko_kr: Ollama가 로컬에서 실행 중이어야 합니다. 새로고침을 클릭하여 사용 가능한 모델을 로드하세요.
ms_my: Ollama mesti berjalan secara tempatan. Klik Muat Semula untuk memuatkan model yang tersedia.
th_th: Ollama ต้องทำงานอยู่ในเครื่อง คลิกรีเฟรชเพื่อโหลด model ที่มีอยู่
vi_vn: Ollama phải đang chạy trên máy. Nhấn Làm mới để tải các model có sẵn.
zh_cn: Ollama 必须在本地运行。点击刷新以加载可用模型。
zh_tw: Ollama 必須在本機運行。點擊重新整理以載入可用模型。

# BuiltInAIDescription
source: Uses GLM (Zhipu AI) or Groq free models. You can provide your own API key from open.bigmodel.cn (GLM) or console.groq.com (Groq).
fr_fr: Utilise les modèles gratuits GLM (Zhipu AI) ou Groq. Vous pouvez fournir votre propre clé API depuis open.bigmodel.cn (GLM) ou console.groq.com (Groq).
ja_jp: GLM（Zhipu AI）またはGroqの無料モデルを使用します。open.bigmodel.cn（GLM）またはconsole.groq.com（Groq）から独自のAPIキーを取得できます。
ko_kr: GLM(Zhipu AI) 또는 Groq 무료 모델을 사용합니다. open.bigmodel.cn(GLM) 또는 console.groq.com(Groq)에서 자신의 API 키를 받을 수 있습니다.
zh_cn: 使用 GLM（智谱 AI）或 Groq 免费模型。您可以从 open.bigmodel.cn（GLM）或 console.groq.com（Groq）获取自己的 API 密钥。
zh_tw: 使用 GLM（智譜 AI）或 Groq 免費模型。您可以從 open.bigmodel.cn（GLM）或 console.groq.com（Groq）取得自己的 API 金鑰。

# BuiltInAIHint
source: The built-in key has limited free quota and is not guaranteed to always be available. For stable use, get your own free API key.
fr_fr: La clé intégrée a un quota gratuit limité et n'est pas garantie d'être toujours disponible. Pour une utilisation stable, obtenez votre propre clé API gratuite.
ja_jp: 内蔵キーには無料枠の制限があり、常に利用可能とは限りません。安定した利用のために、独自の無料APIキーを取得することをお勧めします。
ko_kr: 내장 키는 무료 할당량이 제한되어 있으며 항상 사용 가능하다고 보장되지 않습니다. 안정적인 사용을 위해 자신의 무료 API 키를 받으세요.
zh_cn: 内置密钥有免费额度限制，不保证始终可用。为稳定使用，建议获取自己的免费 API 密钥。
zh_tw: 內建金鑰有免費額度限制，不保證始終可用。為穩定使用，建議取得自己的免費 API 金鑰。

source: Hint
fr_fr: Conseil
ja_jp: ヒント
ko_kr: 힌트
zh_cn: 提示
zh_tw: 提示

# DoubaoDescription
source: ByteDance's Doubao translation service. Get your API key from console.volcengine.com
ar_sa: خدمة ترجمة Doubao من ByteDance. احصل على مفتاح API من console.volcengine.com
da_dk: ByteDances Doubao-oversættelsestjeneste. Hent din API-nøgle fra console.volcengine.com
de_de: ByteDances Doubao-Übersetzungsdienst. Holen Sie sich Ihren API-Schlüssel von console.volcengine.com
fr_fr: Service de traduction Doubao de ByteDance. Obtenez votre clé API sur console.volcengine.com
hi_in: ByteDance की Doubao अनुवाद सेवा। console.volcengine.com से API key प्राप्त करें
id_id: Layanan terjemahan Doubao dari ByteDance. Dapatkan API key dari console.volcengine.com
it_it: Servizio di traduzione Doubao di ByteDance. Ottieni la tua chiave API da console.volcengine.com
ja_jp: ByteDanceの豆包翻訳サービス。console.volcengine.comからAPIキーを取得してください
ko_kr: ByteDance의 豆包 번역 서비스. console.volcengine.com에서 API 키를 받으세요
ms_my: Perkhidmatan terjemahan Doubao dari ByteDance. Dapatkan kunci API dari console.volcengine.com
th_th: บริการแปลภาษา Doubao จาก ByteDance รับ API key จาก console.volcengine.com
vi_vn: Dịch vụ dịch Doubao của ByteDance. Lấy API key tại console.volcengine.com
zh_cn: 字节跳动的豆包翻译服务。从 console.volcengine.com 获取您的 API 密钥
zh_tw: 字節跳動的豆包翻譯服務。從 console.volcengine.com 取得您的 API 金鑰

# CaiyunDescription
source: Get your API key from fanyi.caiyunapp.com
ar_sa: احصل على مفتاح API من fanyi.caiyunapp.com
da_dk: Hent din API-nøgle fra fanyi.caiyunapp.com
de_de: Holen Sie sich Ihren API-Schlüssel von fanyi.caiyunapp.com
fr_fr: Obtenez votre clé API sur fanyi.caiyunapp.com
hi_in: fanyi.caiyunapp.com से API key प्राप्त करें
id_id: Dapatkan API key dari fanyi.caiyunapp.com
it_it: Ottieni la tua chiave API da fanyi.caiyunapp.com
ja_jp: fanyi.caiyunapp.comからAPIキーを取得してください
ko_kr: fanyi.caiyunapp.com에서 API 키를 받으세요
ms_my: Dapatkan kunci API dari fanyi.caiyunapp.com
th_th: รับ API key จาก fanyi.caiyunapp.com
vi_vn: Lấy API key tại fanyi.caiyunapp.com
zh_cn: 从 fanyi.caiyunapp.com 获取您的 API 密钥
zh_tw: 從 fanyi.caiyunapp.com 取得您的 API 金鑰

# NiuTransDescription
source: NiuTrans supports 450+ language pairs. Get your API key from niutrans.com
ar_sa: يدعم NiuTrans أكثر من 450 زوج لغوي. احصل على مفتاح API من niutrans.com
da_dk: NiuTrans understøtter over 450 sprogpar. Hent din API-nøgle fra niutrans.com
de_de: NiuTrans unterstützt über 450 Sprachpaare. Holen Sie sich Ihren API-Schlüssel von niutrans.com
fr_fr: NiuTrans prend en charge plus de 450 paires de langues. Obtenez votre clé API sur niutrans.com
hi_in: NiuTrans 450+ भाषा जोड़ियों का समर्थन करता है। niutrans.com से API key प्राप्त करें
id_id: NiuTrans mendukung lebih dari 450 pasangan bahasa. Dapatkan API key dari niutrans.com
it_it: NiuTrans supporta oltre 450 coppie di lingue. Ottieni la tua chiave API da niutrans.com
ja_jp: NiuTransは450以上の言語ペアをサポート。niutrans.comからAPIキーを取得してください
ko_kr: NiuTrans는 450개 이상의 언어 쌍을 지원합니다. niutrans.com에서 API 키를 받으세요
ms_my: NiuTrans menyokong lebih 450 pasangan bahasa. Dapatkan kunci API dari niutrans.com
th_th: NiuTrans รองรับคู่ภาษามากกว่า 450 คู่ รับ API key จาก niutrans.com
vi_vn: NiuTrans hỗ trợ hơn 450 cặp ngôn ngữ. Lấy API key tại niutrans.com
zh_cn: 小牛翻译支持 450+ 种语言对。从 niutrans.com 获取您的 API 密钥
zh_tw: 小牛翻譯支援 450+ 種語言對。從 niutrans.com 取得您的 API 金鑰

source: App Key
ar_sa: مفتاح التطبيق
da_dk: App-nøgle
it_it: Chiave App
ms_my: Kunci Aplikasi
zh_cn: 应用密钥

source: App Secret
ar_sa: سر التطبيق
da_dk: App-hemmelighed
it_it: Segreto App
ms_my: Rahsia Aplikasi
zh_cn: 应用密钥密码

source: Use Official API
ar_sa: استخدام API الرسمي
da_dk: Brug officiel API
de_de: Offizielle API verwenden
fr_fr: Utiliser l'API officielle
hi_in: आधिकारिक API का उपयोग करें
id_id: Gunakan API Resmi
it_it: Usa API ufficiale
ja_jp: 公式APIを使用
ko_kr: 공식 API 사용
ms_my: Gunakan API Rasmi
th_th: ใช้ API อย่างเป็นทางการ
vi_vn: Sử dụng API chính thức
zh_cn: 使用官方 API
zh_tw: 使用官方 API

# YoudaoDescription
source: Youdao provides phonetic transcriptions for English words. Without API keys, uses free web dictionary. With API keys, enables official API for higher limits. Get API keys from ai.youdao.com
ar_sa: يوفر Youdao النطق الصوتي للكلمات الإنجليزية. بدون مفاتيح API، يستخدم قاموس الويب المجاني. مع مفاتيح API، يتيح API الرسمي لحدود أعلى. احصل على مفاتيح API من ai.youdao.com
da_dk: Youdao giver fonetisk transskription for engelske ord. Uden API-nøgler bruges gratis webopslag. Med API-nøgler aktiveres officiel API for højere grænser. Hent API-nøgler fra ai.youdao.com
de_de: Youdao bietet phonetische Transkriptionen für englische Wörter. Ohne API-Schlüssel wird das kostenlose Web-Wörterbuch verwendet. Mit API-Schlüsseln wird die offizielle API für höhere Limits aktiviert. API-Schlüssel erhalten Sie auf ai.youdao.com
fr_fr: Youdao fournit les transcriptions phonétiques des mots anglais. Sans clés API, utilise le dictionnaire web gratuit. Avec des clés API, active l'API officielle pour des limites plus élevées. Obtenez les clés API sur ai.youdao.com
hi_in: Youdao अंग्रेज़ी शब्दों के लिए ध्वन्यात्मक लिप्यंतरण प्रदान करता है। API key के बिना, मुफ़्त वेब शब्दकोश का उपयोग करता है। API key के साथ, उच्च सीमा के लिए आधिकारिक API सक्षम होता है। ai.youdao.com से API key प्राप्त करें
id_id: Youdao menyediakan transkripsi fonetik untuk kata-kata bahasa Inggris. Tanpa API key, menggunakan kamus web gratis. Dengan API key, mengaktifkan API resmi untuk batas lebih tinggi. Dapatkan API key dari ai.youdao.com
it_it: Youdao fornisce trascrizioni fonetiche per parole inglesi. Senza chiavi API, usa il dizionario web gratuito. Con chiavi API, abilita l'API ufficiale per limiti più elevati. Ottieni le chiavi API da ai.youdao.com
ja_jp: 有道は英単語の発音記号を提供します。APIキー未設定時は無料のウェブ辞書を使用します。APIキーを設定すると、公式APIを使用してより高い利用制限が得られます。APIキーは ai.youdao.com から取得できます
ko_kr: 유다오는 영어 단어의 발음 기호를 제공합니다. API 키 미설정 시 무료 웹 사전을 사용합니다. API 키를 설정하면 공식 API를 사용하여 더 높은 사용량을 제공합니다. API 키는 ai.youdao.com에서 받으세요
ms_my: Youdao menyediakan transkripsi fonetik untuk perkataan Inggeris. Tanpa kunci API, menggunakan kamus web percuma. Dengan kunci API, membolehkan API rasmi untuk had lebih tinggi. Dapatkan kunci API dari ai.youdao.com
th_th: Youdao ให้การถอดเสียงสำหรับคำภาษาอังกฤษ ไม่ต้องใช้ API key สำหรับพจนานุกรมเว็บฟรี ใส่ API key เพื่อใช้ API อย่างเป็นทางการที่มีขีดจำกัดสูงกว่า รับ API key จาก ai.youdao.com
vi_vn: Youdao cung cấp phiên âm cho từ tiếng Anh. Không cần API key để sử dụng từ điển web miễn phí. Có API key để dùng API chính thức với giới hạn cao hơn. Lấy API key tại ai.youdao.com
zh_cn: 有道词典提供英文单词的音标。无需 API 密钥即可使用免费网页版词典。配置 API 密钥后可使用官方 API 以获得更高的使用限制。从 ai.youdao.com 获取 API 密钥
zh_tw: 有道提供英語單字的音標。未設定 API 金鑰時使用免費網頁字典。設定 API 金鑰後可使用官方 API 以獲得更高配額。前往 ai.youdao.com 取得 API 金鑰

# FreeServicesTitle
source: Free Services (No Configuration Required)
ar_sa: خدمات مجانية (لا تتطلب تكويناً)
da_dk: Gratis tjenester (ingen konfiguration påkrævet)
de_de: Kostenlose Dienste (Keine Konfiguration erforderlich)
fr_fr: Services gratuits (aucune configuration requise)
hi_in: मुफ़्त सेवाएँ (कॉन्फ़िगरेशन आवश्यक नहीं)
id_id: Layanan Gratis (Tidak Perlu Konfigurasi)
it_it: Servizi gratuiti (Nessuna configurazione richiesta)
ja_jp: 無料サービス（設定不要）
ko_kr: 무료 서비스 (구성 불필요)
ms_my: Perkhidmatan Percuma (Tanpa Konfigurasi)
th_th: บริการฟรี (ไม่ต้องกำหนดค่า)
vi_vn: Dịch vụ miễn phí (Không cần cấu hình)
zh_cn: 免费服务（无需配置）
zh_tw: 免費服務（無需設定）

# FreeServicesDescription
source: Google Translate and Linguee Dictionary work out of the box without API keys.
ar_sa: يعمل Google Translate وقاموس Linguee فوراً بدون مفاتيح API.
da_dk: Google Translate og Linguee Dictionary fungerer med det samme uden API-nøgler.
de_de: Google Translate und Linguee Dictionary funktionieren sofort ohne API-Schlüssel.
fr_fr: Google Traduction fonctionne sans clé API.
hi_in: Google Translate और Linguee Dictionary बिना API key के तुरंत काम करते हैं।
id_id: Google Translate dan Linguee Dictionary langsung berfungsi tanpa API key.
it_it: Google Translate e Linguee Dictionary funzionano subito senza chiavi API.
ja_jp: Google翻訳はAPIキーなしで使用できます。
ko_kr: Google 번역과 Linguee 사전은 API 키 없이 바로 사용할 수 있습니다.
ms_my: Google Translate dan Kamus Linguee berfungsi terus tanpa kunci API.
th_th: Google Translate และ Linguee Dictionary ใช้งานได้ทันทีโดยไม่ต้องใช้ API key
vi_vn: Google Translate và Linguee Dictionary hoạt động ngay mà không cần API key.
zh_cn: Google 翻译无需 API 密钥即可使用。
zh_tw: Google 翻譯無需 API 金鑰即可使用。

source: HTTP Proxy
ar_sa: وكيل HTTP
fr_fr: Proxy HTTP
it_it: Proxy HTTP
ja_jp: HTTPプロキシ
ko_kr: HTTP 프록시
ms_my: Proksi HTTP
zh_cn: HTTP 代理
zh_tw: HTTP 代理

source: Use HTTP Proxy
ar_sa: استخدام وكيل HTTP
da_dk: Brug HTTP-proxy
de_de: HTTP-Proxy verwenden
fr_fr: Utiliser un proxy HTTP
hi_in: HTTP Proxy का उपयोग करें
id_id: Gunakan HTTP Proxy
it_it: Usa proxy HTTP
ja_jp: HTTPプロキシを使用
ko_kr: HTTP 프록시 사용
ms_my: Gunakan Proksi HTTP
th_th: ใช้ HTTP Proxy
vi_vn: Sử dụng HTTP Proxy
zh_cn: 使用 HTTP 代理
zh_tw: 使用 HTTP 代理

source: Proxy URL
ar_sa: عنوان الوكيل
fr_fr: URL du proxy
id_id: URL Proxy
it_it: URL del proxy
ja_jp: プロキシURL
ko_kr: 프록시 URL
ms_my: URL Proksi
th_th: URL ของ Proxy
vi_vn: URL Proxy
zh_cn: 代理地址
zh_tw: 代理位址
